[
  {
    "id": 1768595546004,
    "role": "wdefv",
    "company": "wdefv",
    "salary": "23",
    "type": "IT",
    "experience": "6-8 years",
    "location": "Hyderabad",
    "description": "wdehnjkwsmdcijlk.dcvffddv",
    "applyLink": "https://ruhan.com",
    "featured": false,
    "postedDate": "17 Jan 2026",
    "timestamp": 1768595546005
  },
  {
    "id": 1768578612456,
    "role": "Ryuaqwsd",
    "company": "wdfsdcj",
    "salary": "28903",
    "type": "IT",
    "experience": "Fresger",
    "location": "qwsdj",
    "description": "qswdgbc",
    "applyLink": "https://ruhan.com",
    "featured": false,
    "postedDate": 1768578612456
  },
  {
    "id": 1768574695062,
    "role": "wgybs",
    "company": "wishdjkws",
    "salary": "27890",
    "type": "Non-IT",
    "experience": "77",
    "location": "swuhs",
    "description": "qwsdefrgthyjngfbdsefgrbnh vcdswerstghn bvfdert5dyhjn bvfdergthyjunhbfgvdrgthyng",
    "applyLink": "https://gemini.google.com/app/2096d623fa1b303e"
  },
  {
    "id": 1768574608113,
    "role": "ruhan",
    "company": "GMI Tech",
    "salary": "200000",
    "type": "IT",
    "experience": "Fresher",
    "location": "Bangalore",
    "description": "Who We Are…\r\n\r\nWhen we say, “the stuff dreams are made of,” we’re not just referring to the world of wizards, dragons and superheroes, or even to the wonders of Planet Earth. Behind WBD’s vast portfolio of iconic content and beloved brands, are the storytellers bringing our characters to life, the creators bringing them to your living rooms and the dreamers creating what’s next…\r\n\r\nFrom brilliant creatives, to technology trailblazers, across the globe, WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.\r\n\r\nManager, Software Engineering, Bangalore\r\n\r\nAbout Warner Bros. Discovery:\r\n\r\nWarner Bros. Discovery, a premier global media and entertainment company, offers audiences the world's most differentiated and complete portfolio of content, brands and franchises across television, film, streaming and gaming. The new company combines Warner Media’s premium entertainment, sports and news assets with Discovery's leading non-fiction and international entertainment and sports businesses.\r\n\r\nFor more information, please visit www.wbd.com.\r\n\r\nMeet Our Team:\r\n\r\nWe are the Product Engineering group for Direct-2-Consumer business, and responsible for building OTT Player (HLS and DASH) for several Warner Bros Discovery products across 17 different platforms. We build Player SDK for Android, Apple, Desktop, HWA and STB platforms to provide seamless integration experience to the WBD applications.\r\n\r\nThe ideal candidate has a track record of having built multiple high-performance, stable, scalable Android applications, JAVA / Kotlin tech stack, HLS / DASH Players and expertise in Software Architecture / Design principles. You work with SDE-3 to choose the right architecture and design patterns for solving the business problems. You lead a team of Player SDK developers and own their career progression. You own the quality of the Software product. You are customer obsessed and always challenge yourself to provide the best quality playback experience to the WBD users. You are a team player and collaborate with peers and mentor SDEs. You are self-critical about your work and our product and have a continuous improvement mindset. You groom the backlog and estimations. You are obsessed about Operational Excellence and always strive for engineering excellence. You show good judgment making trade-offs between immediate and long-term business needs.\r\n\r\nRoles & Responsibilities:\r\n• You are experienced and capable of playing a leading role to design and develop major functional changes to existing software systems, or new ones, involving yourself and other Engineers.\r\n• You make good decisions and exercise accurate judgement when choosing to build new vs extending existing ones.\r\n• You provide guidance on design, coding, and operational best practices, and have a track-record of applying these best practices to software that you have worked on\r\n• You propose and proactively seek to establish best practices where none exist.\r\n• You make high impact decisions driving, what and how software is built.\r\n• You analyse requirements, study software architectures and designs to make decisions suiting the requirements. You are often right, and you are persuasive in delivering your suggestions and ideas to your team.\r\n• You mentor junior Engineers, overseeing their designs, code quality, and integration into a team. Your success is judged as much on your own productivity as on the positive impact you have on Engineers around you.\r\n• You communicate through data, dates, and facts, applying them as appropriate to motivate and inspire.\r\n• You are comfortable with scrum agile methodologies, adapting best engineering practices by showing people, not just telling people.\r\n• You are equally passionate about code testability as you are for writing methodical, readable code.\r\n\r\nWhat to Bring:\r\n• 12 - 15 years, experience in architecting and building applications using IOS. Broadcasting Video / OTT domain and AV Player development preferred.\r\n• Servant leadership, Mentoring, Coaching skills to build high performance engineering organization.\r\n• Sound understanding of IOS/Android Architecture, MSE/EME, Media Player APIs, NPM build, etc\r\n• Data driven technical decision-making skills for architecture and design of new product features.\r\n• Eye to details and identify optimization scope for performance improvements.\r\n• Experience in DevOps/SRE practices such as CI/CD, performance monitoring & incident management\r\n• Strong computer Science fundamentals in object-oriented design, algorithm design, problem solving, and complexity analysis.\r\n• Good verbal & written communication skills\r\n\r\nWhat We Offer:\r\n• A Great Place to work\r\n• Equal opportunity employer\r\n• Fast track growth opportunities\r\n\r\nHow We Get Things Done…\r\n\r\nThis last bit is probably the most important! Here at WBD, our guiding principles are the core values by which we operate and are central to how we get things done. You can find them at www.wbd.com/guiding-principles/ along with some insights from the team on what they mean and how they show up in their day to day. We hope they resonate with you and look forward to discussing them during your interview.\r\n\r\nChampioning Inclusion at WBD\r\nWarner Bros. Discovery embraces the opportunity to build a workforce that reflects a wide array of perspectives, backgrounds and experiences. Being an equal opportunity employer means that we take seriously our responsibility to consider qualified candidates on the basis of merit, regardless of sex, gender identity, ethnicity, age, sexual orientation, religion or belief, marital status, pregnancy, parenthood, disability or any other category protected by law.\r\n\r\nIf you’re a qualified candidate with a disability and you require adjustments or accommodations during the job application and/or recruitment process, please visit our accessibility page for instructions to submit your request.\r\nReport this listing",
    "applyLink": "https://gemini.google.com/app/2096d623fa1b303e"
  }
]